tony-cloud/STM32_duino/STM32/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms
# for developer

menu.subboard=Specific Board
menu.startadr=Startup adr
menu.clock_source=Clock source
menu.osc_speed=OSC Speed(MHz)
menu.cpu_speed=cpu Speed(MHz)
menu.usb=USB
menu.serial=Serial communication
menu.jtag_swd=JTAG/SWD debugging
menu.extern_lib=Extern lib
menu.upload_method=Upload method
menu.log=Debug Log_level

#################################### Nucleo-64 ############################################
# NUCLEO 64 board
NUCLEO_64.name=Nucleo-64
NUCLEO_64.vid.0=0x0483
NUCLEO_64.pid.0=0x374B

NUCLEO_64.build.core=arduino
NUCLEO_64.build.board=NUCLEO_64
NUCLEO_64.upload.tool=nucleoFlasher

NUCLEO_64.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

NUCLEO_64.menu.subboard.Nucleo_F030R8=Nucleo-F030R8(48M)
NUCLEO_64.menu.subboard.Nucleo_F030R8.upload.maximum_size=65536
NUCLEO_64.menu.subboard.Nucleo_F030R8.upload.maximum_data_size=8192
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.mcu=cortex-m0
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.series=STM32F0
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.variant=NUCLEO_F030R8
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.board=NUCLEO_F030R8
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.f_cpuhsi=48000000L
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.f_cpuhse=48000000L
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.extra_flags=-DSTM32F030R8
NUCLEO_64.menu.subboard.Nucleo_F030R8.massstorage_drive=NODE_F030R8

NUCLEO_64.menu.subboard.Nucleo_L053R8=Nucleo-L053R8(32M)
NUCLEO_64.menu.subboard.Nucleo_L053R8.upload.maximum_size=65536
NUCLEO_64.menu.subboard.Nucleo_L053R8.upload.maximum_data_size=8192
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.mcu=cortex-m0
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.series=STM32L0
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.variant=NUCLEO_L053R8
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.board=Nucleo_L053R8
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.f_cpuhsi=32000000L
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.f_cpuhse=32000000L
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.extra_flags=-DSTM32L053R8
NUCLEO_64.menu.subboard.Nucleo_L053R8.massstorage_drive=NODE_L053R8

NUCLEO_64.menu.subboard.Nucleo_F103RB=Nucleo-F103RB(HSI48M/HSE72M)
NUCLEO_64.menu.subboard.Nucleo_F103RB.upload.maximum_size=131072
NUCLEO_64.menu.subboard.Nucleo_F103RB.upload.maximum_data_size=20480
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.mcu=cortex-m3
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.series=STM32F1
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.variant=NUCLEO_F103RB
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.board=NUCLEO_F103RB
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.f_cpuhsi=48000000L
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.f_cpuhse=72000000L
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.extra_flags=-DSTM32F103RB
NUCLEO_64.menu.subboard.Nucleo_F103RB.massstorage_drive=NODE_F103RB

NUCLEO_64.menu.subboard.Nucleo_F303RE=Nucleo-F303RE(HSI48M/HSE72M)
NUCLEO_64.menu.subboard.Nucleo_F303RE.upload.maximum_size=524288
NUCLEO_64.menu.subboard.Nucleo_F303RE.upload.maximum_data_size=81920
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.series=STM32F3
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.variant=NUCLEO_F303RE
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.board=NUCLEO_F303RE
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.f_cpuhsi=48000000L
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.f_cpuhse=72000000L
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.extra_flags=-DSTM32F303RE
NUCLEO_64.menu.subboard.Nucleo_F303RE.massstorage_drive=NODE_F303RE

NUCLEO_64.menu.subboard.Nucleo_L152RE=Nucleo-L152RE(32M)
NUCLEO_64.menu.subboard.Nucleo_L152RE.upload.maximum_size=524288
NUCLEO_64.menu.subboard.Nucleo_L152RE.upload.maximum_data_size=81920
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.mcu=cortex-m3
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.series=STM32L1
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.variant=NUCLEO_L152RE
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.board=NUCLEO_L152RE
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.f_cpuhsi=32000000L
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.f_cpuhse=32000000L
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.extra_flags=-DSTM32L152RE
NUCLEO_64.menu.subboard.Nucleo_L152RE.massstorage_drive=NODE_L152RE

NUCLEO_64.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
NUCLEO_64.menu.clock_source.bypass.build.f_cpu={build.f_cpuhse} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

NUCLEO_64.menu.clock_source.hsi=HSE_Disable(HSI)
NUCLEO_64.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

NUCLEO_64.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
NUCLEO_64.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000


NUCLEO_64.menu.upload_method.MassStorageMethod=Mass Storage
NUCLEO_64.menu.upload_method.MassStorageMethod.upload.protocol=
NUCLEO_64.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

NUCLEO_64.menu.upload_method.STLinkMethod=STLink
NUCLEO_64.menu.upload_method.STLinkMethod.upload.protocol=STLink
NUCLEO_64.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

NUCLEO_64.menu.log.default=NONE
NUCLEO_64.menu.log.fatal=FATAL
NUCLEO_64.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
NUCLEO_64.menu.log.error=ERROR
NUCLEO_64.menu.log.error.build.log_level=-D__LOG_LEVEL=2
NUCLEO_64.menu.log.warning=WARNING
NUCLEO_64.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
NUCLEO_64.menu.log.info=INFO
NUCLEO_64.menu.log.info.build.log_level=-D__LOG_LEVEL=4
NUCLEO_64.menu.log.debug=DEBUG
NUCLEO_64.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
NUCLEO_64.menu.log.trace=TRACE
NUCLEO_64.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

#################################### Nucleo-F207ZG ############################################
#Nucleo_F207ZG board

Nucleo_F207ZG.name=Nucleo-F207ZG
Nucleo_F207ZG.vid.0=0x0483
Nucleo_F207ZG.pid.0=0x374B

Nucleo_F207ZG.build.core=arduino
Nucleo_F207ZG.build.board=NUCLEO_144
Nucleo_F207ZG.upload.tool=nucleoFlasher

