tony-cloud/STM32_duino/STM32/boards.txt
Nucleo_F207ZG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3

Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG=Nucleo-F207ZG(120M)
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.upload.maximum_size=1048576
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.build.mcu=cortex-m3
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.build.series=STM32F2
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.build.variant=NUCLEO_F207ZG
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.build.board=NUCLEO_F207ZG
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.build.extra_flags0=-DSTM32F207ZG
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.massstorage_drive=NODE_F207ZG
Nucleo_F207ZG.menu.subboard.Nucleo_F207ZG.build.f_cpupre=120000000L

Nucleo_F207ZG.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
Nucleo_F207ZG.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

Nucleo_F207ZG.menu.clock_source.hsi=HSE_Disable(HSI)
Nucleo_F207ZG.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

Nucleo_F207ZG.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
Nucleo_F207ZG.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000


Nucleo_F207ZG.menu.startadr.default=flash(default)
Nucleo_F207ZG.menu.startadr.default.build.extra_flags={build.extra_flags0}

Nucleo_F207ZG.menu.startadr.F08020000=flash 1:0x08020000(128k)
Nucleo_F207ZG.menu.startadr.F08020000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F08020000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
Nucleo_F207ZG.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
Nucleo_F207ZG.menu.startadr.F08020000.upload.uploadadr=0x08020000
Nucleo_F207ZG.menu.startadr.F08020000.upload.vect=0x08020000

Nucleo_F207ZG.menu.startadr.F08040000=flash 2:0x08040000(128k)
Nucleo_F207ZG.menu.startadr.F08040000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F08040000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
Nucleo_F207ZG.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
Nucleo_F207ZG.menu.startadr.F08040000.upload.uploadadr=0x08040000
Nucleo_F207ZG.menu.startadr.F08040000.upload.vect=0x08040000

Nucleo_F207ZG.menu.startadr.F08060000=flash 3:0x08060000(128k)
Nucleo_F207ZG.menu.startadr.F08060000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F08060000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
Nucleo_F207ZG.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
Nucleo_F207ZG.menu.startadr.F08060000.upload.uploadadr=0x08060000
Nucleo_F207ZG.menu.startadr.F08060000.upload.vect=0x08060000

Nucleo_F207ZG.menu.startadr.F08080000=flash 4:0x08080000(128k)
Nucleo_F207ZG.menu.startadr.F08080000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F08080000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
Nucleo_F207ZG.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
Nucleo_F207ZG.menu.startadr.F08080000.upload.uploadadr=0x08080000
Nucleo_F207ZG.menu.startadr.F08080000.upload.vect=0x08080000

Nucleo_F207ZG.menu.startadr.F080A0000=flash 5:0x080A0000(128k)
Nucleo_F207ZG.menu.startadr.F080A0000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F080A0000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F080A0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xA0000
Nucleo_F207ZG.menu.startadr.F080A0000.build.ldscript={build.ldscript_pre}_080A.ld
Nucleo_F207ZG.menu.startadr.F080A0000.upload.uploadadr=0x080A0000
Nucleo_F207ZG.menu.startadr.F080A0000.upload.vect=0x080A0000

Nucleo_F207ZG.menu.startadr.F080C0000=flash 6:0x080C0000(128k)
Nucleo_F207ZG.menu.startadr.F080C0000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F080C0000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
Nucleo_F207ZG.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
Nucleo_F207ZG.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
Nucleo_F207ZG.menu.startadr.F080C0000.upload.vect=0x080C0000

Nucleo_F207ZG.menu.startadr.F080E0000=flash 7:0x080E0000(128k)
Nucleo_F207ZG.menu.startadr.F080E0000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F080E0000.upload.maximum_data_size=131072
Nucleo_F207ZG.menu.startadr.F080E0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xE0000
Nucleo_F207ZG.menu.startadr.F080E0000.build.ldscript={build.ldscript_pre}_080E.ld
Nucleo_F207ZG.menu.startadr.F080E0000.upload.uploadadr=0x080E0000
Nucleo_F207ZG.menu.startadr.F080E0000.upload.vect=0x080E0000

Nucleo_F207ZG.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
Nucleo_F207ZG.menu.startadr.F08000000.upload.maximum_size=131072
Nucleo_F207ZG.menu.startadr.F08000000.upload.maximum_data_size=32768
Nucleo_F207ZG.menu.startadr.F08000000.build.extra_flags={build.extra_flags0}  -DCHK_JUMP_TO_SRAM
Nucleo_F207ZG.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
Nucleo_F207ZG.menu.startadr.F08000000.upload.uploadadr=0x08000000
Nucleo_F207ZG.menu.startadr.F08000000.upload.vect=0x08000000

Nucleo_F207ZG.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
Nucleo_F207ZG.menu.startadr.R20000000.upload.maximum_size=98304
Nucleo_F207ZG.menu.startadr.R20000000.upload.maximum_data_size=32768
Nucleo_F207ZG.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
Nucleo_F207ZG.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
Nucleo_F207ZG.menu.startadr.R20000000.upload.uploadadr=0x20000000
Nucleo_F207ZG.menu.startadr.R20000000.upload.vect=0x20000000

Nucleo_F207ZG.upload.protocol=STLink
Nucleo_F207ZG.upload.tool=stlink_upload


Nucleo_F207ZG.menu.log.default=NONE
Nucleo_F207ZG.menu.log.fatal=FATAL
Nucleo_F207ZG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
Nucleo_F207ZG.menu.log.error=ERROR
Nucleo_F207ZG.menu.log.error.build.log_level=-D__LOG_LEVEL=2
Nucleo_F207ZG.menu.log.warning=WARNING
Nucleo_F207ZG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
Nucleo_F207ZG.menu.log.info=INFO
Nucleo_F207ZG.menu.log.info.build.log_level=-D__LOG_LEVEL=4
Nucleo_F207ZG.menu.log.debug=DEBUG
Nucleo_F207ZG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
Nucleo_F207ZG.menu.log.trace=TRACE
Nucleo_F207ZG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

