tony-cloud/STM32_duino/STM32/boards.txt
Nucleo-F411RE.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
Nucleo-F411RE.menu.startadr.R20000000.upload.maximum_size=98304
Nucleo-F411RE.menu.startadr.R20000000.upload.maximum_data_size=32768
Nucleo-F411RE.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
Nucleo-F411RE.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
Nucleo-F411RE.menu.startadr.R20000000.upload.uploadadr=0x20000000
Nucleo-F411RE.menu.startadr.R20000000.upload.vect=0x20000000

Nucleo-F411RE.upload.protocol=STLink
Nucleo-F411RE.upload.tool=stlink_upload

Nucleo-F411RE.menu.log.default=NONE
Nucleo-F411RE.menu.log.fatal=FATAL
Nucleo-F411RE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
Nucleo-F411RE.menu.log.error=ERROR
Nucleo-F411RE.menu.log.error.build.log_level=-D__LOG_LEVEL=2
Nucleo-F411RE.menu.log.warning=WARNING
Nucleo-F411RE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
Nucleo-F411RE.menu.log.info=INFO
Nucleo-F411RE.menu.log.info.build.log_level=-D__LOG_LEVEL=4
Nucleo-F411RE.menu.log.debug=DEBUG
Nucleo-F411RE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
Nucleo-F411RE.menu.log.trace=TRACE
Nucleo-F411RE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

#################################### Nucleo-F767ZI ############################################
#Nucleo_F767ZI board

Nucleo_F767ZI.name=Nucleo-F767ZI(216M)
Nucleo_F767ZI.vid.0=0x0483
Nucleo_F767ZI.pid.0=0x374B

Nucleo_F767ZI.build.core=arduino
Nucleo_F767ZI.build.variant=NUCLEO_F767ZI
Nucleo_F767ZI.build.board=NUCLEO_F767ZI

Nucleo_F767ZI.upload.maximum_size=2097152
Nucleo_F767ZI.upload.maximum_data_size=524288
Nucleo_F767ZI.upload.uploadadr=0x08000000
Nucleo_F767ZI.upload.vect=0x08000000
Nucleo_F767ZI.upload.device=STM32F767ZI

Nucleo_F767ZI.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3
Nucleo_F767ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
#Nucleo_F767ZI.build.mcu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard 
Nucleo_F767ZI.build.series=STM32F7
Nucleo_F767ZI.build.extra_flags0=-DSTM32F767ZI
Nucleo_F767ZI.build.ldscript_pre=ld/f767xI
Nucleo_F767ZI.build.f_cpupre=216000000L

Nucleo_F767ZI.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
Nucleo_F767ZI.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

Nucleo_F767ZI.menu.clock_source.hsi=HSE_Disable(HSI)
Nucleo_F767ZI.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

Nucleo_F767ZI.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
Nucleo_F767ZI.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

Nucleo_F767ZI.menu.startadr.default=flash(default)
Nucleo_F767ZI.menu.startadr.default.build.extra_flags={build.extra_flags0}

Nucleo_F767ZI.menu.startadr.F08040000=flash 1:0x08040000(256k)
Nucleo_F767ZI.menu.startadr.F08040000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08040000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
Nucleo_F767ZI.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
Nucleo_F767ZI.menu.startadr.F08040000.upload.uploadadr=0x08040000
Nucleo_F767ZI.menu.startadr.F08040000.upload.vect=0x08040000

Nucleo_F767ZI.menu.startadr.F08080000=flash 2:0x08080000(256k)
Nucleo_F767ZI.menu.startadr.F08080000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08080000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
Nucleo_F767ZI.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
Nucleo_F767ZI.menu.startadr.F08080000.upload.uploadadr=0x08080000
Nucleo_F767ZI.menu.startadr.F08080000.upload.vect=0x08080000

Nucleo_F767ZI.menu.startadr.F080C0000=flash 3:0x080C0000(256k)
Nucleo_F767ZI.menu.startadr.F080C0000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F080C0000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
Nucleo_F767ZI.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
Nucleo_F767ZI.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
Nucleo_F767ZI.menu.startadr.F080C0000.upload.vect=0x080C0000

Nucleo_F767ZI.menu.startadr.F08100000=flash 4:0x08100000(256k)
Nucleo_F767ZI.menu.startadr.F08100000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08100000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08100000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x100000
Nucleo_F767ZI.menu.startadr.F08100000.build.ldscript={build.ldscript_pre}_0810.ld
Nucleo_F767ZI.menu.startadr.F08100000.upload.uploadadr=0x08100000
Nucleo_F767ZI.menu.startadr.F08100000.upload.vect=0x08100000

Nucleo_F767ZI.menu.startadr.F08140000=flash 5:0x08140000(256k)
Nucleo_F767ZI.menu.startadr.F08140000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08140000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08140000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x140000
Nucleo_F767ZI.menu.startadr.F08140000.build.ldscript={build.ldscript_pre}_0814.ld
Nucleo_F767ZI.menu.startadr.F08140000.upload.uploadadr=0x08140000
Nucleo_F767ZI.menu.startadr.F08140000.upload.vect=0x08140000

Nucleo_F767ZI.menu.startadr.F08180000=flash 6:0x08180000(256k)
Nucleo_F767ZI.menu.startadr.F08180000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08180000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08180000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x180000
Nucleo_F767ZI.menu.startadr.F08180000.build.ldscript={build.ldscript_pre}_0818.ld
Nucleo_F767ZI.menu.startadr.F08180000.upload.uploadadr=0x08180000
Nucleo_F767ZI.menu.startadr.F08180000.upload.vect=0x08180000

Nucleo_F767ZI.menu.startadr.F081C0000=flash 7:0x081C0000(256k)
Nucleo_F767ZI.menu.startadr.F081C0000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F081C0000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F081C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x1C0000
Nucleo_F767ZI.menu.startadr.F081C0000.build.ldscript={build.ldscript_pre}_081C.ld
Nucleo_F767ZI.menu.startadr.F081C0000.upload.uploadadr=0x081C0000
Nucleo_F767ZI.menu.startadr.F081C0000.upload.vect=0x081C0000

Nucleo_F767ZI.menu.startadr.F08000000=flash(WithRamBoot used 256kRAM Only)
Nucleo_F767ZI.menu.startadr.F08000000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08000000.upload.maximum_data_size=262144
Nucleo_F767ZI.menu.startadr.F08000000.build.extra_flags={build.extra_flags0}  -DCHK_JUMP_TO_SRAM
Nucleo_F767ZI.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
Nucleo_F767ZI.menu.startadr.F08000000.upload.uploadadr=0x08000000
Nucleo_F767ZI.menu.startadr.F08000000.upload.vect=0x08000000

Nucleo_F767ZI.menu.startadr.R20000000=Sram 0:0x20000000(256K+256K use bootloader only)
Nucleo_F767ZI.menu.startadr.R20000000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.R20000000.upload.maximum_data_size=262144
Nucleo_F767ZI.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
Nucleo_F767ZI.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
Nucleo_F767ZI.menu.startadr.R20000000.upload.uploadadr=0x20000000
Nucleo_F767ZI.menu.startadr.R20000000.upload.vect=0x20000000

Nucleo_F767ZI.upload.protocol=STLink
Nucleo_F767ZI.upload.tool=stlink_upload


