tony-cloud/STM32_duino/STM32/boards.txt
F030F.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F030F.menu.upload_method.serialMethod.upload.protocol=maple_serial
F030F.menu.upload_method.serialMethod.upload.tool=serial_upload

F030F.menu.log.default=NONE
F030F.menu.log.fatal=FATAL
F030F.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
F030F.menu.log.error=ERROR
F030F.menu.log.error.build.log_level=-D__LOG_LEVEL=2
F030F.menu.log.warning=WARNING
F030F.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
F030F.menu.log.info=INFO
F030F.menu.log.info.build.log_level=-D__LOG_LEVEL=4
F030F.menu.log.debug=DEBUG
F030F.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
F030F.menu.log.trace=TRACE
F030F.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

####################################MapleMini_F103C board############################################
MapleMini.name=MapleMini F103C

MapleMini.upload.uploadadr=0x08000000
MapleMini.upload.vect=0x08000000
MapleMini.serial.disableDTR=true
MapleMini.serial.disableRTS=true

MapleMini.build.mcu=cortex-m3
MapleMini.build.core=arduino
MapleMini.build.board=MAPLE_MINI
MapleMini.build.variant=MAPLE_MINI
MapleMini.build.series=STM32F1

MapleMini.menu.subboard.F103CB=MapleMini F103CB[LED PB1/SWD]
MapleMini.menu.subboard.F103CB.upload.maximum_size=131072
MapleMini.menu.subboard.F103CB.upload.maximum_data_size=20480
MapleMini.menu.subboard.F103CB.build.extra_flags=-DSTM32F103CB
MapleMini.menu.subboard.F103CB.build.ldscript_pre=ld/f103xB
MapleMini.menu.subboard.F103CB.build.ldscript=ld/f103xB.ld
MapleMini.menu.subboard.F103CB.build.board=MAPLEMINI_F103CB
MapleMini.menu.subboard.F103CB.build.extra_flags_jtag=-DMENU_DEBUG_SWD

MapleMini.menu.subboard.F103C8=MapleMini F103C8[LED PB1/SWD]
MapleMini.menu.subboard.F103C8.upload.maximum_size=65536
MapleMini.menu.subboard.F103C8.upload.maximum_data_size=20480
MapleMini.menu.subboard.F103C8.build.extra_flags=-DSTM32F103C8
MapleMini.menu.subboard.F103C8.build.ldscript_pre=ld/f103x8
MapleMini.menu.subboard.F103C8.build.ldscript=ld/f103x8.ld
MapleMini.menu.subboard.F103C8.build.board=MAPLEMINI_F103C8
MapleMini.menu.subboard.F103C8.build.extra_flags_jtag=-DMENU_DEBUG_SWD

MapleMini.menu.clock_source.hse=8M(HSE)_72M
MapleMini.menu.clock_source.hse.build.f_cpu=72000000L -DHSE_VALUE=8000000

MapleMini.menu.clock_source.hsi=8M(HSI)_48M
MapleMini.menu.clock_source.hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
MapleMini.menu.upload_method.STLinkMethod=STLink  [Automatic serial=SerialUSB]
MapleMini.menu.upload_method.STLinkMethod.upload.protocol=STLink
MapleMini.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
MapleMini.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini.menu.upload_method.jLinkMethod=JLink [Automatic serial=SerialUSB]
MapleMini.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
MapleMini.menu.upload_method.jLinkMethod.upload.protocol=jlink
MapleMini.menu.upload_method.jLinkMethod.upload.device=STM32F103C8

MapleMini.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10,BOOT0(button)=1(press when reset)]
MapleMini.menu.upload_method.serialMethod.upload.protocol=maple_serial
MapleMini.menu.upload_method.serialMethod.upload.tool=serial_upload
MapleMini.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

MapleMini.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
MapleMini.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
MapleMini.menu.upload_method.BMPMethod.upload.tool=bmp_upload

MapleMini.menu.upload_method.DFUUploadMethod2=USB DFU - STM32duino bootloader (0x2000)
MapleMini.menu.upload_method.DFUUploadMethod2.upload.protocol=maple_dfu
MapleMini.menu.upload_method.DFUUploadMethod2.upload.tool=maple_upload
MapleMini.menu.upload_method.DFUUploadMethod2.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x2000 -DUSB_DISC_PIN=PB9
MapleMini.menu.upload_method.DFUUploadMethod2.build.ldscript={build.ldscript_pre}_bootloader_2000.ld
MapleMini.menu.upload_method.DFUUploadMethod2.upload.usbID=1EAF:0003
MapleMini.menu.upload_method.DFUUploadMethod2.upload.altID=UNUSED
MapleMini.menu.upload_method.DFUUploadMethod2.maximum_data_size=122880
MapleMini.menu.upload_method.DFUUploadMethod2.flash.maximum_size=122880
MapleMini.menu.upload_method.DFUUploadMethod2.ram.maximum_size=20480
MapleMini.menu.upload_method.DFUUploadMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini.menu.upload_method.DFUUploadMethod1=USB DFU - Maple bootloader (original version) (0x5000)
MapleMini.menu.upload_method.DFUUploadMethod1.upload.protocol=maple_dfu
MapleMini.menu.upload_method.DFUUploadMethod1.upload.tool=maple_upload
MapleMini.menu.upload_method.DFUUploadMethod1.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x5000 -DUSB_DISC_PIN=PB9
MapleMini.menu.upload_method.DFUUploadMethod1.build.ldscript={build.ldscript_pre}_bootloader_5000.ld
MapleMini.menu.upload_method.DFUUploadMethod1.upload.usbID=1EAF:0003
MapleMini.menu.upload_method.DFUUploadMethod1.upload.altID=UNUSED
MapleMini.menu.upload_method.DFUUploadMethod1.maximum_data_size=110592
MapleMini.menu.upload_method.DFUUploadMethod1.flash.maximum_size=110592
MapleMini.menu.upload_method.DFUUploadMethod1.ram.maximum_size=17408
MapleMini.menu.upload_method.DFUUploadMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini.menu.usb.Disabled=Disabled USB
MapleMini.menu.usb.SerialUSB=Serial[Virtual COM port, PA11/PA12]
MapleMini.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
MapleMini.menu.usb.SerialMSC=Mass storage
MapleMini.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
MapleMini.menu.usb.Composite=Composite[CDC+MSC]
MapleMini.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

MapleMini.menu.serial.SerialUSB=SerialUSB
MapleMini.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
MapleMini.menu.serial.SerialUART1=SerialUART1
MapleMini.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
MapleMini.menu.serial.Automatic=Automatically selected based on upload method

