tony-cloud/STM32_duino/STM32/boards.txt
#MapleMini.menu.jtag_swd.default=Debug_default[SWD]
MapleMini.menu.jtag_swd.SWD=SWD [debug pins reserved: (PA14,PA13)]
MapleMini.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
MapleMini.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB3,PB4,PA13,PA14,PA15]
MapleMini.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
MapleMini.menu.jtag_swd.Disabled=Disabled [debug pins free]
MapleMini.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

MapleMini.menu.log.default=NONE
MapleMini.menu.log.fatal=FATAL
MapleMini.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
MapleMini.menu.log.error=ERROR
MapleMini.menu.log.error.build.log_level=-D__LOG_LEVEL=2
MapleMini.menu.log.warning=WARNING
MapleMini.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
MapleMini.menu.log.info=INFO
MapleMini.menu.log.info.build.log_level=-D__LOG_LEVEL=4
MapleMini.menu.log.debug=DEBUG
MapleMini.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
MapleMini.menu.log.trace=TRACE
MapleMini.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

####################################### F103CB#########################################
# BluePill board
BluePill.name=F103Cx
BluePill.upload.uploadadr=0x08000000
BluePill.upload.vect=0x08000000
BluePill.serial.disableDTR=true
BluePill.serial.disableRTS=true

BluePill.build.mcu=cortex-m3
BluePill.build.board=BLUEPILL_F103CB
BluePill.build.core=arduino
BluePill.build.variant=BLUEPILL
BluePill.build.series=STM32F1
BluePill.build.f_cpu=72000000L

BluePill.menu.subboard.F103CB=BluePill F103CB[LED PC13/SWD]
BluePill.menu.subboard.F103CB.upload.maximum_size=131072
BluePill.menu.subboard.F103CB.upload.maximum_data_size=20480
BluePill.menu.subboard.F103CB.upload.device=STM32F103CB
BluePill.menu.subboard.F103CB.build.extra_flags0=-DSTM32F103CB
BluePill.menu.subboard.F103CB.build.ldscript_pre=ld/f103xB
BluePill.menu.subboard.F103CB.build.ldscript=ld/f103xB.ld
BluePill.menu.subboard.F103CB.build.board=BluePill_F103CB
BluePill.menu.subboard.F103CB.build.extra_flags_jtag=-DMENU_DEBUG_SWD

BluePill.menu.subboard.F103C8=BluePill F103C8[LED PC13/SWD]
BluePill.menu.subboard.F103C8.upload.maximum_size=65536
BluePill.menu.subboard.F103C8.upload.maximum_data_size=20480
BluePill.menu.subboard.F103C8.upload.device=STM32F103C8
BluePill.menu.subboard.F103C8.build.extra_flags0=-DSTM32F103C8
BluePill.menu.subboard.F103C8.build.ldscript_pre=ld/f103x8
BluePill.menu.subboard.F103C8.build.ldscript=ld/f103x8.ld
BluePill.menu.subboard.F103C8.build.board=BluePill_F103C8
BluePill.menu.subboard.F103C8.build.extra_flags_jtag=-DMENU_DEBUG_SWD

BluePill.menu.subboard.GF103CB=GENERIC F103CB[LED PB8/JTAG]
BluePill.menu.subboard.GF103CB.upload.maximum_size=131072
BluePill.menu.subboard.GF103CB.upload.maximum_data_size=20480
BluePill.menu.subboard.GF103CB.upload.device=STM32F103CB
BluePill.menu.subboard.GF103CB.build.extra_flags0=-DSTM32F103CB  -DLED_BUILTIN=PB8
BluePill.menu.subboard.GF103CB.build.ldscript=ld/f103xB.ld
BluePill.menu.subboard.GF103CB.build.board=F103CB_PB8

BluePill.menu.subboard.GF103C8=GENERIC F103C8(LED PB8/JTAG)
BluePill.menu.subboard.GF103C8.upload.maximum_size=65536
BluePill.menu.subboard.GF103C8.upload.maximum_data_size=20480
BluePill.menu.subboard.GF103C8.upload.device=STM32F103C8
BluePill.menu.subboard.GF103C8.build.extra_flags0=-DSTM32F103C8  -DLED_BUILTIN=PB8
BluePill.menu.subboard.GF103C8.build.ldscript=ld/f103x8.ld
BluePill.menu.subboard.GF103C8.build.board=F103C8_PB8

BluePill.menu.startadr.default=flash (default)
BluePill.menu.startadr.default.build.extra_flags={build.extra_flags0}

BluePill.menu.startadr.F08004000=flash 1:0x08004000(32k)
BluePill.menu.startadr.F08004000.upload.maximum_size=32768
BluePill.menu.startadr.F08004000.upload.maximum_data_size=20480
BluePill.menu.startadr.F08004000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x04000
BluePill.menu.startadr.F08004000.build.ldscript=ld/f103xB_08004.ld
BluePill.menu.startadr.F08004000.upload.uploadadr=0x08004000
BluePill.menu.startadr.F08004000.upload.vect=0x08004000

BluePill.menu.startadr.F0800C000=flash 2:0x0800C000(32k) 
BluePill.menu.startadr.F0800C000.upload.maximum_size=65525
BluePill.menu.startadr.F0800C000.upload.maximum_data_size=20480
BluePill.menu.startadr.F0800C000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0C000
BluePill.menu.startadr.F0800C000.build.ldscript=ld/f103xB_0800c.ld
BluePill.menu.startadr.F0800C000.upload.uploadadr=0x0800C000
BluePill.menu.startadr.F0800C000.upload.vect=0x0800C000

BluePill.menu.startadr.F08014000=flash 3:0x08014000(48k)
BluePill.menu.startadr.F08014000.upload.maximum_size=49152
BluePill.menu.startadr.F08014000.upload.maximum_data_size=20480
BluePill.menu.startadr.F08014000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x14000
BluePill.menu.startadr.F08014000.build.ldscript=ld/f103xB_08014.ld
BluePill.menu.startadr.F08014000.upload.uploadadr=0x08014000
BluePill.menu.startadr.F08014000.upload.vect=0x08014000

BluePill.menu.startadr.F08000000=flash(WithRamBoot 16kflash + 4kRAM used Only)
BluePill.menu.startadr.F08000000.upload.maximum_size=16384
BluePill.menu.startadr.F08000000.upload.maximum_data_size=4096
BluePill.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
BluePill.menu.startadr.F08000000.build.ldscript=ld/f103xB_0800.ld
BluePill.menu.startadr.F08000000.upload.uploadadr=0x08000000
BluePill.menu.startadr.F08000000.upload.vect=0x08000000

BluePill.menu.startadr.R20000000=Sram 0:0x20000000(16K+4K BOOT=11 St/Jlink uploader only)
BluePill.menu.startadr.R20000000.upload.maximum_size=16384
BluePill.menu.startadr.R20000000.upload.maximum_data_size=4096
BluePill.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
BluePill.menu.startadr.R20000000.build.ldscript=ld/f103xB_RAM0.ld
BluePill.menu.startadr.R20000000.upload.uploadadr=0x20000000
BluePill.menu.startadr.R20000000.upload.vect=0x20000000

BluePill.menu.osc_speed.speed_08m=8M(HSE)_72M
BluePill.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
BluePill.menu.osc_speed.speed_hsi=8M(HSI)_72M
BluePill.menu.osc_speed.speed_hsi.build.f_cpu=72000000L -DUSE_HSI
BluePill.menu.osc_speed.speed_hsi=8M(HSI)_48M
BluePill.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
BluePill.menu.upload_method.STLinkMethod=STLink(SerialUSB)
BluePill.menu.upload_method.STLinkMethod.upload.protocol=STLink
BluePill.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
BluePill.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.upload_method.jLinkMethod=JLink(SerialUSB)
BluePill.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
BluePill.menu.upload_method.jLinkMethod.upload.protocol=jlink
BluePill.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

