tony-cloud/STM32_duino/STM32/boards.txt
BluePill.menu.upload_method.serialMethod=SerialUART1 [TX/PA9, RX/PA10, BOOT0=1]
BluePill.menu.upload_method.serialMethod.upload.protocol=maple_serial
BluePill.menu.upload_method.serialMethod.upload.tool=serial_upload
BluePill.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

BluePill.menu.upload_method.BMPMethod=BMP(SerialUSB)
BluePill.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
BluePill.menu.upload_method.BMPMethod.upload.tool=bmp_upload
BluePill.menu.upload_method.BMPMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.usb.Disabled=Disabled USB
BluePill.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
BluePill.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
BluePill.menu.usb.SerialMSC=Mass storage
BluePill.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
BluePill.menu.usb.Composite=Composite[CDC+MSC]
BluePill.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

BluePill.menu.serial.SerialUSB=SerialUSB
BluePill.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
BluePill.menu.serial.SerialUART1=SerialUART1
BluePill.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

#BluePill.menu.jtag_swd.default=Debug_default
BluePill.menu.jtag_swd.JTAG=JTAG [reserved: PA13, PA14, PA15, PB3, PB4]
BluePill.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
BluePill.menu.jtag_swd.SWD=SWD [debug pins reserved: PA13, PA14]
BluePill.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
BluePill.menu.jtag_swd.Disabled=Disabled [debug pins free]
BluePill.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

BluePill.menu.log.default=NONE
BluePill.menu.log.fatal=FATAL
BluePill.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
BluePill.menu.log.error=ERROR
BluePill.menu.log.error.build.log_level=-D__LOG_LEVEL=2
BluePill.menu.log.warning=WARNING
BluePill.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
BluePill.menu.log.info=INFO
BluePill.menu.log.info.build.log_level=-D__LOG_LEVEL=4
BluePill.menu.log.debug=DEBUG
BluePill.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
BluePill.menu.log.trace=TRACE
BluePill.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

##################################### L152C ###########################################
# L152C board(32M)
L152C.name=L152Cx(32M)
L152C.serial.disableDTR=true
L152C.serial.disableRTS=true

L152C.build.core=arduino
L152C.build.board=L152C

L152C.build.mcu=cortex-m3
L152C.build.series=STM32L1

L152C.menu.subboard.L152CB=L152CB
L152C.menu.subboard.L152CB.upload.maximum_size=131072
L152C.menu.subboard.L152CB.upload.maximum_data_size=16384
L152C.menu.subboard.L152CB.build.variant=L152C
L152C.menu.subboard.L152CB.build.extra_flags=-DSTM32L152CB
L152C.menu.subboard.L152CB.build.ldscript=ld/l152cb.ld

L152C.menu.subboard.L152C8=L152C8
L152C.menu.subboard.L152C8.upload.maximum_size=65536
L152C.menu.subboard.L152C8.upload.maximum_data_size=10240
L152C.menu.subboard.L152C8.build.variant=L152C
L152C.menu.subboard.L152C8.build.extra_flags=-DSTM32L152C8
L152C.menu.subboard.L152C8.build.ldscript=ld/l152c8.ld

L152C.build.f_cpupre=32000000L

L152C.menu.clock_source.hse8m=HSE(8M)
L152C.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

L152C.menu.clock_source.hsi=HSI
L152C.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

L152C.menu.upload_method.STLinkMethod=STLink
L152C.menu.upload_method.STLinkMethod.upload.protocol=STLink
L152C.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

L152C.menu.upload_method.MassStorageMethod=Mass Storage
L152C.menu.upload_method.MassStorageMethod.upload.protocol=
L152C.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
L152C.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

L152C.menu.usb.Disabled=Disabled USB
L152C.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
L152C.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
L152C.menu.usb.SerialMSC=Mass storage
L152C.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
L152C.menu.usb.Composite=Composite[CDC+MSC]
L152C.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

L152C.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/10]
L152C.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
L152C.menu.serial.SerialUSB=SerialUSB (USB connector)
L152C.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

L152C.menu.log.default=NONE
L152C.menu.log.fatal=FATAL
L152C.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
L152C.menu.log.error=ERROR
L152C.menu.log.error.build.log_level=-D__LOG_LEVEL=2
L152C.menu.log.warning=WARNING
L152C.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
L152C.menu.log.info=INFO
L152C.menu.log.info.build.log_level=-D__LOG_LEVEL=4
L152C.menu.log.debug=DEBUG
L152C.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
L152C.menu.log.trace=TRACE
L152C.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

###################################### GD103RB #######################################
GD103RB.name=GD32F103RB
GD103RB.vid.0=0x067B
GD103RB.pid.0=0x2303

GD103RB.serial.disableDTR=true
GD103RB.serial.disableRTS=true
GD103RB.upload.uploadadr=0x08000000
GD103RB.upload.vect=0x08000000

GD103RB.build.board=F103R
GD103RB.build.core=arduino
GD103RB.build.series=STM32F1
GD103RB.build.mcu=cortex-m3

GD103RB.menu.subboard.F103RB=ALIENTEK_MINI[F103RB/SWD]
GD103RB.menu.subboard.F103RB.upload.maximum_size=131072
GD103RB.menu.subboard.F103RB.upload.maximum_data_size=20480
GD103RB.menu.subboard.F103RB.upload.device=STM32F103RB
GD103RB.menu.subboard.F103RB.build.extra_flags0=-DSTM32F103RB
GD103RB.menu.subboard.F103RB.build.variant=ATKMINI_F103R
GD103RB.menu.subboard.F103RB.build.board=ATKMINI_F103RB
GD103RB.menu.subboard.F103RB.build.ldscript=ld/f103xB.ld
GD103RB.menu.subboard.F103RB.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103RB.menu.subboard.F103RB.massstorage_drive=NUCLEO

GD103RB.menu.subboard.F103RB1=GENERIC_F103RB[LED PC13/JTAG]
GD103RB.menu.subboard.F103RB1.upload.maximum_size=131072
GD103RB.menu.subboard.F103RB1.upload.maximum_data_size=20480
GD103RB.menu.subboard.F103RB1.upload.device=STM32F103RB
GD103RB.menu.subboard.F103RB1.build.extra_flags0=-DSTM32F103RB
GD103RB.menu.subboard.F103RB1.build.variant=F103R_GD
GD103RB.menu.subboard.F103RB1.build.board=GENERIC_F103RB
GD103RB.menu.subboard.F103RB1.build.ldscript=ld/f103xB.ld
GD103RB.menu.subboard.F103RB1.massstorage_drive=NUCLEO

GD103RB.menu.startadr.default=flash (default)
GD103RB.menu.startadr.default.build.extra_flags={build.extra_flags0}

GD103RB.menu.startadr.F08010000=flash 1:0x08004000(32k)
GD103RB.menu.startadr.F08010000.upload.maximum_size=32768
GD103RB.menu.startadr.F08010000.upload.maximum_data_size=20480
GD103RB.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x04000
GD103RB.menu.startadr.F08010000.build.ldscript=ld/f103xB_08004.ld
GD103RB.menu.startadr.F08010000.upload.uploadadr=0x0800400
GD103RB.menu.startadr.F08010000.upload.vect=0x0800400

GD103RB.menu.startadr.F08020000=flash 2:0x0800C000(32k) 
GD103RB.menu.startadr.F08020000.upload.maximum_size=32768
GD103RB.menu.startadr.F08020000.upload.maximum_data_size=20480
GD103RB.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xc000
GD103RB.menu.startadr.F08020000.build.ldscript=ld/f103xB_0800c.ld
GD103RB.menu.startadr.F08020000.upload.uploadadr=0x0800c000
GD103RB.menu.startadr.F08020000.upload.vect=0x0800c000

