tony-cloud/STM32_duino/STM32/boards.txt
GD103RE.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13/JTAG]
GD103RE.menu.subboard.F103RE1.upload.maximum_size=524288
GD103RE.menu.subboard.F103RE1.upload.maximum_data_size=65536
GD103RE.menu.subboard.F103RE1.upload.device=STM32F103RE
GD103RE.menu.subboard.F103RE1.build.extra_flags0=-DSTM32F103RE
GD103RE.menu.subboard.F103RE1.build.variant=F103R_GD
GD103RE.menu.subboard.F103RE1.build.board=GENERIC_F103RE
GD103RE.menu.subboard.F103RE1.build.ldscript=ld/f103xE.ld
GD103RE.menu.subboard.F103RE1.massstorage_drive=NUCLEO

GD103RE.menu.startadr.default=flash (default)
GD103RE.menu.startadr.default.build.extra_flags={build.extra_flags0}

GD103RE.menu.startadr.F08010000=flash 1:0x08010000(64k)
GD103RE.menu.startadr.F08010000.upload.maximum_size=65536
GD103RE.menu.startadr.F08010000.upload.maximum_data_size=65536
GD103RE.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
GD103RE.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
GD103RE.menu.startadr.F08010000.upload.uploadadr=0x08010000
GD103RE.menu.startadr.F08010000.upload.vect=0x08010000

GD103RE.menu.startadr.F08020000=flash 2:0x08020000(64k)
GD103RE.menu.startadr.F08020000.upload.maximum_size=65536
GD103RE.menu.startadr.F08020000.upload.maximum_data_size=65536
GD103RE.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
GD103RE.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
GD103RE.menu.startadr.F08020000.upload.uploadadr=0x08020000
GD103RE.menu.startadr.F08020000.upload.vect=0x08020000

GD103RE.menu.startadr.F08030000=flash 3:0x08030000(64k)
GD103RE.menu.startadr.F08030000.upload.maximum_size=65536
GD103RE.menu.startadr.F08030000.upload.maximum_data_size=65536
GD103RE.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
GD103RE.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
GD103RE.menu.startadr.F08030000.upload.uploadadr=0x08030000
GD103RE.menu.startadr.F08030000.upload.vect=0x08030000

GD103RE.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
GD103RE.menu.startadr.F08000000.upload.maximum_size=65536
GD103RE.menu.startadr.F08000000.upload.maximum_data_size=20480
GD103RE.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
GD103RE.menu.startadr.F08000000.build.ldscript=ld/f103xE_0800.ld
GD103RE.menu.startadr.F08000000.upload.uploadadr=0x08000000
GD103RE.menu.startadr.F08000000.upload.vect=0x08000000

GD103RE.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
GD103RE.menu.startadr.R20000000.upload.maximum_size=45056
GD103RE.menu.startadr.R20000000.upload.maximum_data_size=20480
GD103RE.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
GD103RE.menu.startadr.R20000000.build.ldscript=ld/f103xE_RAM0.ld
GD103RE.menu.startadr.R20000000.upload.uploadadr=0x20000000
GD103RE.menu.startadr.R20000000.upload.vect=0x20000000

#GD103RE.menu.startadr.R20000200=Sram 1:0x20000200(43K+20K Serial upload)
#GD103RE.menu.startadr.R20000200.upload.maximum_size=44544
#GD103RE.menu.startadr.R20000200.upload.maximum_data_size=20480
#GD103RE.menu.startadr.R20000200.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x00000200U -DVECT_TAB_SRAM
#GD103RE.menu.startadr.R20000200.build.ldscript=ld/f103xE_RAM200.ld
#GD103RE.menu.startadr.R20000200.upload.uploadadr=0x20000200
#GD103RE.menu.startadr.R20000200.upload.vect=0x20000200

GD103RE.menu.osc_speed.speed_08m=8M (HSE)
GD103RE.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103RE.menu.osc_speed.speed_12m=12M (HSE)
GD103RE.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103RE.menu.osc_speed.speed_hsi=8M (HSI)
GD103RE.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

GD103RE.menu.cpu_speed.F120=120M(overdrive)
GD103RE.menu.cpu_speed.F120.build.f_cpu=120000000L -DGD32F10X  {build.osc}

GD103RE.menu.cpu_speed.F96=96M(Stable)
GD103RE.menu.cpu_speed.F96.build.f_cpu=96000000L -DGD32F10X {build.osc}

GD103RE.menu.cpu_speed.F72=72M(compatible with STM)


GD103RE.menu.cpu_speed.F72.build.f_cpu=72000000L -DGD32F10X  {build.osc}


#---------------------------- UPLOAD METHODS ---------------------------
GD103RE.menu.upload_method.STLinkMethod=STLink
GD103RE.menu.upload_method.STLinkMethod.upload.protocol=STLink
GD103RE.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
GD103RE.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RE.menu.upload_method.jLinkMethod=JLink
GD103RE.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
GD103RE.menu.upload_method.jLinkMethod.upload.protocol=jlink
GD103RE.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RE.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
GD103RE.menu.upload_method.MassStorageMethod.upload.protocol=
GD103RE.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

GD103RE.menu.upload_method.serialMethod=Serial[TX/PA9, RX/PA10, BOOT0=1]
GD103RE.menu.upload_method.serialMethod.upload.protocol=maple_serial
GD103RE.menu.upload_method.serialMethod.upload.tool=serial_upload
GD103RE.menu.upload_method.serialMethod.upload.altID=UNUSED
GD103RE.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RE.menu.upload_method.serialMethod1=Serial[pl2302 AutoLoad]
GD103RE.menu.upload_method.serialMethod1.upload.protocol=maple_serial
GD103RE.menu.upload_method.serialMethod1.upload.tool=serial_upload
GD103RE.menu.upload_method.serialMethod1.upload.altID=PL2303
GD103RE.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RE.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
GD103RE.menu.upload_method.serialMethod2.upload.protocol=maple_serial
GD103RE.menu.upload_method.serialMethod2.upload.tool=serial_upload
GD103RE.menu.upload_method.serialMethod2.upload.altID=CH340
GD103RE.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RE.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
GD103RE.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
GD103RE.menu.upload_method.BMPMethod.upload.tool=bmp_upload

GD103RE.menu.usb.Disabled=Disabled USB
GD103RE.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
GD103RE.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
GD103RE.menu.usb.SerialMSC=Mass storage
GD103RE.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
GD103RE.menu.usb.Composite=Composite[CDC+MSC]
GD103RE.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

GD103RE.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
GD103RE.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
GD103RE.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
GD103RE.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
GD103RE.menu.serial.SerialUSB=SerialUSB
GD103RE.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#GD103RE.menu.jtag_swd.default=Debug_default
GD103RE.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
GD103RE.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
GD103RE.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14, PA13]
GD103RE.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103RE.menu.jtag_swd.Disabled=Disabled [debug pins free]
GD103RE.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

GD103RE.menu.log.default=NONE
GD103RE.menu.log.fatal=FATAL
GD103RE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
GD103RE.menu.log.error=ERROR
GD103RE.menu.log.error.build.log_level=-D__LOG_LEVEL=2
GD103RE.menu.log.warning=WARNING
GD103RE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
GD103RE.menu.log.info=INFO
GD103RE.menu.log.info.build.log_level=-D__LOG_LEVEL=4
GD103RE.menu.log.debug=DEBUG
GD103RE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
GD103RE.menu.log.trace=TRACE
GD103RE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

######################################F103R#######################################
F103R.name=F103R
F103R.vid.0=0x067B
F103R.pid.0=0x2303

F103R.serial.disableDTR=true
F103R.serial.disableRTS=true
F103R.upload.uploadadr=0x08000000
F103R.upload.vect=0x08000000

