tony-cloud/STM32_duino/STM32/boards.txt
F103R.build.board=F103R
F103R.build.core=arduino
F103R.build.series=STM32F1
F103R.build.mcu=cortex-m3

F103R.menu.subboard.F103RE=ALIENTEK_MINI[F103RE/SWD]
F103R.menu.subboard.F103RE.upload.maximum_size=524288
F103R.menu.subboard.F103RE.upload.maximum_data_size=65536
F103R.menu.subboard.F103RE.upload.device=STM32F103RE
F103R.menu.subboard.F103RE.build.extra_flags0=-DSTM32F103RE
F103R.menu.subboard.F103RE.build.variant=ATKMINI_F103R
F103R.menu.subboard.F103RE.build.board=ATKMINI_F103RE
F103R.menu.subboard.F103RE.build.ldscript=ld/f103xE.ld
F103R.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.subboard.F103RE.massstorage_drive=NUCLEO

#F103R.menu.subboard.F103RB=ALIENTEK_MINI[F103RB/SWD]
#F103R.menu.subboard.F103RB.upload.maximum_size=131072
#F103R.menu.subboard.F103RB.upload.maximum_data_size=20480
#F103R.menu.subboard.F103RB.upload.device=STM32F103RB
#F103R.menu.subboard.F103RB.build.extra_flags0=-DSTM32F103RB
#F103R.menu.subboard.F103RB.build.variant=ATKMINI_F103R
#F103R.menu.subboard.F103RB.build.board=ATKMINI_F103RB
#F103R.menu.subboard.F103RB.build.ldscript=ld/f103xB.ld
#F103R.menu.subboard.F103RB.build.extra_flags_jtag=-DMENU_DEBUG_SWD
#F103R.menu.subboard.F103RB.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RC=GENERIC_F103RC[LED PC13/JTAG]
F103R.menu.subboard.F103RC.upload.maximum_size=262144
F103R.menu.subboard.F103RC.upload.maximum_data_size=49152
F103R.menu.subboard.F103RC.upload.device=STM32F103RC
F103R.menu.subboard.F103RC.build.extra_flags0=-DSTM32F103RC
F103R.menu.subboard.F103RC.build.variant=F103R
F103R.menu.subboard.F103RC.build.board=GENERIC_F103RC
F103R.menu.subboard.F103RC.build.ldscript=ld/f103xC.ld
F103R.menu.subboard.F103RC.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13/JTAG]
F103R.menu.subboard.F103RE1.upload.maximum_size=524288
F103R.menu.subboard.F103RE1.upload.maximum_data_size=65536
F103R.menu.subboard.F103RE1.upload.device=STM32F103RE
F103R.menu.subboard.F103RE1.build.extra_flags0=-DSTM32F103RE
F103R.menu.subboard.F103RE1.build.variant=F103R
F103R.menu.subboard.F103RE1.build.board=GENERIC_F103RE
F103R.menu.subboard.F103RE1.build.ldscript=ld/f103xE.ld
F103R.menu.subboard.F103RE1.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RF=GENERIC_F103RF[LED PC13/JTAG]
F103R.menu.subboard.F103RF.upload.maximum_size=786432
F103R.menu.subboard.F103RF.upload.maximum_data_size=98304
F103R.menu.subboard.F103RF.upload.device=STM32F103RF
F103R.menu.subboard.F103RF.build.extra_flags0=-DSTM32F103RF
F103R.menu.subboard.F103RF.build.variant=F103R
F103R.menu.subboard.F103RF.build.board=GENERIC_F103RF
F103R.menu.subboard.F103RF.build.ldscript=ld/f103xF.ld
F103R.menu.subboard.F103RF.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RG=GENERIC_F103RG[LED PC13/JTAG]
F103R.menu.subboard.F103RG.upload.maximum_size=1048576
F103R.menu.subboard.F103RG.upload.maximum_data_size=98304
F103R.menu.subboard.F103RG.pload.device=STM32F103RG
F103R.menu.subboard.F103RG.build.extra_flags0=-DSTM32F103RG
F103R.menu.subboard.F103RG.build.variant=F103R
F103R.menu.subboard.F103RG.build.board=GENERIC_F103RG
F103R.menu.subboard.F103RG.build.ldscript=ld/f103xG.ld
F103R.menu.subboard.F103RG.massstorage_drive=NUCLEO

F103R.menu.startadr.default=flash(default)
F103R.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103R.menu.startadr.F08010000=flash 1:0x08010000(64k)
F103R.menu.startadr.F08010000.upload.maximum_size=65536
F103R.menu.startadr.F08010000.upload.maximum_data_size=65536
F103R.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F103R.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
F103R.menu.startadr.F08010000.upload.uploadadr=0x08010000
F103R.menu.startadr.F08010000.upload.vect=0x08010000

F103R.menu.startadr.F08020000=flash 2:0x08020000(64k)
F103R.menu.startadr.F08020000.upload.maximum_size=65536
F103R.menu.startadr.F08020000.upload.maximum_data_size=65536
F103R.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F103R.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
F103R.menu.startadr.F08020000.upload.uploadadr=0x08020000
F103R.menu.startadr.F08020000.upload.vect=0x08020000

F103R.menu.startadr.F08030000=flash 3:0x08030000(64k)
F103R.menu.startadr.F08030000.upload.maximum_size=65536
F103R.menu.startadr.F08030000.upload.maximum_data_size=65536
F103R.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
F103R.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
F103R.menu.startadr.F08030000.upload.uploadadr=0x08030000
F103R.menu.startadr.F08030000.upload.vect=0x08030000

F103R.menu.startadr.F08040000=flash 4:0x08040000(64k)
F103R.menu.startadr.F08040000.upload.maximum_size=65536
F103R.menu.startadr.F08040000.upload.maximum_data_size=65536
F103R.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F103R.menu.startadr.F08040000.build.ldscript=ld/f103xE_0804.ld
F103R.menu.startadr.F08040000.upload.uploadadr=0x08040000
F103R.menu.startadr.F08040000.upload.vect=0x08040000

F103R.menu.startadr.F08050000=flash 5:0x08050000(64k)
F103R.menu.startadr.F08050000.upload.maximum_size=65536
F103R.menu.startadr.F08050000.upload.maximum_data_size=65536
F103R.menu.startadr.F08050000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x50000
F103R.menu.startadr.F08050000.build.ldscript=ld/f103xE_0805.ld
F103R.menu.startadr.F08050000.upload.uploadadr=0x08050000
F103R.menu.startadr.F08050000.upload.vect=0x08050000

F103R.menu.startadr.F08060000=flash 6:0x08060000(64k)
F103R.menu.startadr.F08060000.upload.maximum_size=65536
F103R.menu.startadr.F08060000.upload.maximum_data_size=65536
F103R.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F103R.menu.startadr.F08060000.build.ldscript=ld/f103xE_0806.ld
F103R.menu.startadr.F08060000.upload.uploadadr=0x08060000
F103R.menu.startadr.F08060000.upload.vect=0x08060000

F103R.menu.startadr.F08070000=flash 7:0x08070000(64k)
F103R.menu.startadr.F08070000.upload.maximum_size=65536
F103R.menu.startadr.F08070000.upload.maximum_data_size=65536
F103R.menu.startadr.F08070000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x70000
F103R.menu.startadr.F08070000.build.ldscript=ld/f103xE_0807.ld
F103R.menu.startadr.F08070000.upload.uploadadr=0x08070000
F103R.menu.startadr.F08070000.upload.vect=0x08070000

F103R.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F103R.menu.startadr.F08000000.upload.maximum_size=65536
F103R.menu.startadr.F08000000.upload.maximum_data_size=20480
F103R.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F103R.menu.startadr.F08000000.build.ldscript=ld/f103xE_0800.ld
F103R.menu.startadr.F08000000.upload.uploadadr=0x08000000
F103R.menu.startadr.F08000000.upload.vect=0x08000000

