tony-cloud/STM32_duino/STM32/boards.txt
F103R.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F103R.menu.startadr.R20000000.upload.maximum_size=45056
F103R.menu.startadr.R20000000.upload.maximum_data_size=20480
F103R.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103R.menu.startadr.R20000000.build.ldscript=ld/f103xE_RAM0.ld
F103R.menu.startadr.R20000000.upload.uploadadr=0x20000000
F103R.menu.startadr.R20000000.upload.vect=0x20000000

F103R.menu.osc_speed.speed_08m=8M(HSE)_72M
F103R.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
F103R.menu.osc_speed.speed_hsi1=8M(HSI)_72M
F103R.menu.osc_speed.speed_hsi1.build.f_cpu=72000000L -DUSE_HSI
F103R.menu.osc_speed.speed_hsi0=8M(HSI)_48M
F103R.menu.osc_speed.speed_hsi0.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F103R.menu.upload_method.STLinkMethod=STLink 
F103R.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103R.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103R.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R.menu.upload_method.jLinkMethod=JLink
F103R.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103R.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103R.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103R.menu.upload_method.MassStorageMethod.upload.protocol=
F103R.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103R.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F103R.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod.upload.altID=UNUSED
F103R.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103R.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod1.upload.altID=PL2303
F103R.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103R.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod2.upload.altID=CH340
F103R.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103R.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103R.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103R.menu.usb.Disabled=Disabled USB
F103R.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103R.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103R.menu.usb.SerialMSC=Mass storage
F103R.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103R.menu.usb.Composite=Composite[CDC+MSC]
F103R.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103R.menu.serial.SerialUART1=SerialUART1
F103R.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103R.menu.serial.SerialUART2=SerialUART2
F103R.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103R.menu.serial.SerialUSB=SerialUSB
F103R.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#F103R.menu.jtag_swd.default=Debug_default
F103R.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103R.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103R.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103R.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103R.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

F103R.menu.log.default=NONE
F103R.menu.log.fatal=FATAL
F103R.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1
F103R.menu.log.error=ERROR
F103R.menu.log.error.build.log_level=-D__LOG_LEVEL=2
F103R.menu.log.warning=WARNING
F103R.menu.log.warning.build.log_level=-D__LOG_LEVEL=3
F103R.menu.log.info=INFO
F103R.menu.log.info.build.log_level=-D__LOG_LEVEL=4
F103R.menu.log.debug=DEBUG
F103R.menu.log.debug.build.log_level=-D__LOG_LEVEL=5
F103R.menu.log.trace=TRACE
F103R.menu.log.trace.build.log_level=-D__LOG_LEVEL=6

##################################F103V board##############################################
F103V.name=F103V
F103V.vid.0=0x067B
F103V.pid.0=0x2303

F103V.build.mcu=cortex-m3
F103V.build.board=GENERIC_F103V
F103V.build.core=arduino
F103V.build.series=STM32F1
F103V.build.f_cpu=72000000L

F103V.serial.disableDTR=true
F103V.serial.disableRTS=true
F103V.upload.uploadadr=0x08000000
F103V.upload.vect=0x08000000

F103V.menu.subboard.F103VE=ArmFly_X2[F103VE PL2303]
F103V.menu.subboard.F103VE.upload.maximum_size=524288
F103V.menu.subboard.F103VE.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE.upload.device=STM32F103VE
F103V.menu.subboard.F103VE.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE.build.variant=ARMFLY_X2_F103VE
F103V.menu.subboard.F103VE.build.board=ARMFLY_X2
F103V.menu.subboard.F103VE.build.ldscript=ld/f103xE.ld
F103V.menu.subboard.F103VE.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE.upload.protocol=maple_serial
F103V.menu.subboard.F103VE.upload.tool=serial_upload
F103V.menu.subboard.F103VE.upload.altID=PL2303
F103V.menu.subboard.F103VE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VC=GENERIC_F103VC[CH430]
F103V.menu.subboard.F103VC.upload.maximum_size=262144
F103V.menu.subboard.F103VC.upload.maximum_data_size=49152
F103V.menu.subboard.F103VC.upload.device=STM32F103VC
F103V.menu.subboard.F103VC.build.extra_flags0=-DSTM32F103VC
F103V.menu.subboard.F103VC.build.variant=F103V
F103V.menu.subboard.F103VC.build.board=GENERIC_F103VC
F103V.menu.subboard.F103VC.build.ldscript=ld/f103xC.ld
F103V.menu.subboard.F103VC.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VC.upload.protocol=maple_serial
F103V.menu.subboard.F103VC.upload.tool=serial_upload
F103V.menu.subboard.F103VC.upload.altID=CH340
F103V.menu.subboard.F103VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VE1=GENERIC_F103VE[CH430]
F103V.menu.subboard.F103VE1.upload.maximum_size=524288
F103V.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V.menu.subboard.F103VE1.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE1.build.variant=F103V
F103V.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V.menu.subboard.F103VE1.build.ldscript=ld/f103xE.ld
F103V.menu.subboard.F103VE1.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE1.upload.protocol=maple_serial
F103V.menu.subboard.F103VE1.upload.tool=serial_upload
F103V.menu.subboard.F103VE1.upload.altID=CH340
F103V.menu.subboard.F103VE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

