tony-cloud/STM32_duino/STM32/boards.txt
#F103V.menu.subboard.F103VF=GENERIC_F103VF[CH340]
#F103V.menu.subboard.F103VF.upload.maximum_size=786432
#F103V.menu.subboard.F103VF.upload.maximum_data_size=98304
#F103V.menu.subboard.F103VF.upload.device=STM32F103VF
#F103V.menu.subboard.F103VF.build.extra_flags0=-DSTM32F103VF
#F103V.menu.subboard.F103VF.build.variant=F103V
#F103V.menu.subboard.F103VF.build.board=GENERIC_F103VF
#F103V.menu.subboard.F103VF.build.ldscript=ld/f103xF.ld
#F103V.menu.subboard.F103VF.massstorage_drive=NUCLEO
#F103V.menu.subboard.F103VF.upload.protocol=maple_serial
#F103V.menu.subboard.F103VF.upload.tool=serial_upload
#F103V.menu.subboard.F103VF.upload.altID=CH340
#F103V.menu.subboard.F103VF.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

#F103V.menu.subboard.F103VG=GENERIC_F103VG[CH340]
#F103V.menu.subboard.F103VG.upload.maximum_size=1048576
#F103V.menu.subboard.F103VG.upload.maximum_data_size=98304
#F103V.menu.subboard.F103VG.upload.device=STM32F103VG
#F103V.menu.subboard.F103VG.build.extra_flags0=-DSTM32F103VG
#F103V.menu.subboard.F103VG.build.variant=F103V
#F103V.menu.subboard.F103VG.build.board=GENERIC_F103VG
#F103V.menu.subboard.F103VG.build.ldscript=ld/f103xG.ld
#F103V.menu.subboard.F103VG.massstorage_drive=NUCLEO
#F103V.menu.subboard.F103VG.upload.protocol=maple_serial
#F103V.menu.subboard.F103VG.upload.tool=serial_upload
#F103V.menu.subboard.F103VG.upload.altID=CH340
#F103V.menu.subboard.F103VG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.startadr.default=flash(default)
F103V.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103V.menu.startadr.F08010000=flash 1:0x08010000(64k)
F103V.menu.startadr.F08010000.upload.maximum_size=65536
F103V.menu.startadr.F08010000.upload.maximum_data_size=65536
F103V.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F103V.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
F103V.menu.startadr.F08010000.upload.uploadadr=0x08010000
F103V.menu.startadr.F08010000.upload.vect=0x08010000

F103V.menu.startadr.F08020000=flash 2:0x08020000(64k)
F103V.menu.startadr.F08020000.upload.maximum_size=65536
F103V.menu.startadr.F08020000.upload.maximum_data_size=65536
F103V.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F103V.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
F103V.menu.startadr.F08020000.upload.uploadadr=0x08020000
F103V.menu.startadr.F08020000.upload.vect=0x08020000

F103V.menu.startadr.F08030000=flash 3:0x08030000(64k)
F103V.menu.startadr.F08030000.upload.maximum_size=65536
F103V.menu.startadr.F08030000.upload.maximum_data_size=65536
F103V.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
F103V.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
F103V.menu.startadr.F08030000.upload.uploadadr=0x08030000
F103V.menu.startadr.F08030000.upload.vect=0x08030000

F103V.menu.startadr.F08040000=flash 4:0x08040000(64k)
F103V.menu.startadr.F08040000.upload.maximum_size=65536
F103V.menu.startadr.F08040000.upload.maximum_data_size=65536
F103V.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F103V.menu.startadr.F08040000.build.ldscript=ld/f103xE_0804.ld
F103V.menu.startadr.F08040000.upload.uploadadr=0x08040000
F103V.menu.startadr.F08040000.upload.vect=0x08040000

F103V.menu.startadr.F08050000=flash 5:0x08050000(64k)
F103V.menu.startadr.F08050000.upload.maximum_size=65536
F103V.menu.startadr.F08050000.upload.maximum_data_size=65536
F103V.menu.startadr.F08050000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x50000
F103V.menu.startadr.F08050000.build.ldscript=ld/f103xE_0805.ld
F103V.menu.startadr.F08050000.upload.uploadadr=0x08050000
F103V.menu.startadr.F08050000.upload.vect=0x08050000

F103V.menu.startadr.F08060000=flash 6:0x08060000(64k)
F103V.menu.startadr.F08060000.upload.maximum_size=65536
F103V.menu.startadr.F08060000.upload.maximum_data_size=65536
F103V.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F103V.menu.startadr.F08060000.build.ldscript=ld/f103xE_0806.ld
F103V.menu.startadr.F08060000.upload.uploadadr=0x08060000
F103V.menu.startadr.F08060000.upload.vect=0x08060000

F103V.menu.startadr.F08070000=flash 7:0x08070000(64k)
F103V.menu.startadr.F08070000.upload.maximum_size=65536
F103V.menu.startadr.F08070000.upload.maximum_data_size=65536
F103V.menu.startadr.F08070000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x70000
F103V.menu.startadr.F08070000.build.ldscript=ld/f103xE_0807.ld
F103V.menu.startadr.F08070000.upload.uploadadr=0x08070000
F103V.menu.startadr.F08070000.upload.vect=0x08070000

F103V.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F103V.menu.startadr.F08000000.upload.maximum_size=65536
F103V.menu.startadr.F08000000.upload.maximum_data_size=20480
F103V.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F103V.menu.startadr.F08000000.build.ldscript=ld/f103xE_0800.ld
F103V.menu.startadr.F08000000.upload.uploadadr=0x08000000
F103V.menu.startadr.F08000000.upload.vect=0x08000000

F103V.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F103V.menu.startadr.R20000000.upload.maximum_size=45056
F103V.menu.startadr.R20000000.upload.maximum_data_size=20480
F103V.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V.menu.startadr.R20000000.build.ldscript=ld/f103xE_RAM0.ld
F103V.menu.startadr.R20000000.upload.uploadadr=0x20000000
F103V.menu.startadr.R20000000.upload.vect=0x20000000

F103V.menu.extern_lib.NONE=NONE
F103V.menu.extern_lib.STemWin=STemWin
F103V.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103V.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103V.menu.extern_lib.STemWinOS=STemWin_OS
F103V.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103V.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#---------------------------- UPLOAD METHODS ---------------------------
F103V.menu.upload_method.STLinkMethod=STLink
F103V.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103V.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103V.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.jLinkMethod=JLink
F103V.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103V.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103V.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

